################################################################
##                      N E T B L A Z E
##    КОМПЛЕКС ФУНКЦИЙ ДЛЯ РАБОТЫ С СЕТЯМИ ПЕРЕДАЧИ ДАННЫХ; 
##  ИЗВЛЕЧЕНИЯ, ОБРАБОТКИ, МОДИФИКАЦИИ, СОХРАНЕНИЯ ИНФОРМАЦИИ
## 
## 
## Версия:   0.3
## Дата:     2026-02-10
## Автор:    github.com/Balans097
################################################################

# 0.3 — исправление ошибок, формирование единого модуля (2026-02-10)
# 0.2 — реализация ключевых функций библиотек 
#       htmlparser, nimbrowser (2026-02-09)
# 0.1 — начальная реализация библиотеки (2026-02-08)



import ./htmlentities
import ./htmlparser
import ./nimbrowser


export htmlentities
export htmlparser
export nimbrowser